//Написать программу, определяющую площадь треугольника по координатам его вершин (x1,y1), (x2,y2), (x3,y3).
#include <iostream>
#include <math.h>
using namespace std;
int main()
{
    double x1, x2, x3, y1, y2, y3, s;
    cout << "Введите координаты вершин треугольника: ";
    cin >> x1 >> y1 >> x2 >> y2 >> x3 >> y3;
    s = 0.5 * abs((x2 - x1) * (y3 - y1) - (x3 - x1) * (y2 - y1));
    cout << s;
}
//(-1;0),(5;0),(2;3) = 9
//(2;-3),(2;3),(-4;4) = 18
//(3;4),(2;1),(7;8) = 4